# IFCFileReadOptions Class

---
This class contains options to read an IFC file.
SystemObject Autodesk.Revit.DB.IFCIFCFileReadOptions
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IFCFileReadOptions : IDisposable

    Public Class IFCFileReadOptions
    	Implements IDisposable

    public ref class IFCFileReadOptions : IDisposable

    type IFCFileReadOptions =
        class
            interface IDisposable
        end
The IFCFileReadOptions type exposes the following members.
| Name| Description
---|---|---
| IFCFileReadOptions|  Creates a default IFCFileReadOptions.
Top
| Name| Description
---|---|---
| FileName|  The full file name of the IFC file to be read.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| XMLConfigFileName|  The XML configuration file name. It is used only for reading IFC-XML format file.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the IFCFileReadOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.IFC Namespace